antmicro/pigweed/targets/mimxrt595_evk_freertos/config/board.c
/* BOARD_SetFlexspiClock run in RAM used to configure FlexSPI clock source and divider when XIP. */
void BOARD_SetFlexspiClock(FLEXSPI_Type *base, uint32_t src, uint32_t divider)
{
    if (base == FLEXSPI0)
    {
        if ((CLKCTL0->FLEXSPI0FCLKSEL != CLKCTL0_FLEXSPI0FCLKSEL_SEL(src)) ||
            ((CLKCTL0->FLEXSPI0FCLKDIV & CLKCTL0_FLEXSPI0FCLKDIV_DIV_MASK) != (divider - 1)))
        {
            /* Always deinit FLEXSPI and init FLEXSPI for the flash to make sure the flash works correctly after the
             FLEXSPI root clock changed as the default FLEXSPI configuration may does not work for the new root clock
             frequency. */
            BOARD_DeinitFlash(base);

            /* Disable clock before changing clock source */
            CLKCTL0->PSCCTL0_CLR = CLKCTL0_PSCCTL0_CLR_FLEXSPI0_OTFAD_CLK_MASK;
            /* Update flexspi clock. */
            CLKCTL0->FLEXSPI0FCLKSEL = CLKCTL0_FLEXSPI0FCLKSEL_SEL(src);
            CLKCTL0->FLEXSPI0FCLKDIV |= CLKCTL0_FLEXSPI0FCLKDIV_RESET_MASK; /* Reset the divider counter */
            CLKCTL0->FLEXSPI0FCLKDIV = CLKCTL0_FLEXSPI0FCLKDIV_DIV(divider - 1);
            while ((CLKCTL0->FLEXSPI0FCLKDIV) & CLKCTL0_FLEXSPI0FCLKDIV_REQFLAG_MASK)
            {
            }
            /* Enable FLEXSPI clock again */
            CLKCTL0->PSCCTL0_SET = CLKCTL0_PSCCTL0_SET_FLEXSPI0_OTFAD_CLK_MASK;

            BOARD_InitFlash(base);
        }
    }
    else if (base == FLEXSPI1)
    {
        if ((CLKCTL0->FLEXSPI1FCLKSEL != CLKCTL0_FLEXSPI1FCLKSEL_SEL(src)) ||
            ((CLKCTL0->FLEXSPI1FCLKDIV & CLKCTL0_FLEXSPI1FCLKDIV_DIV_MASK) != (divider - 1)))
        {
            /* Always deinit FLEXSPI and init FLEXSPI for the flash to make sure the flash works correctly after the
             FLEXSPI root clock changed as the default FLEXSPI configuration may does not work for the new root clock
             frequency. */
            BOARD_DeinitFlash(base);

            /* Disable clock before changing clock source */
            CLKCTL0->PSCCTL0_CLR = CLKCTL0_PSCCTL0_CLR_FLEXSPI1_CLK_MASK;
            /* Update flexspi clock. */
            CLKCTL0->FLEXSPI1FCLKSEL = CLKCTL0_FLEXSPI1FCLKSEL_SEL(src);
            CLKCTL0->FLEXSPI1FCLKDIV |= CLKCTL0_FLEXSPI1FCLKDIV_RESET_MASK; /* Reset the divider counter */
            CLKCTL0->FLEXSPI1FCLKDIV = CLKCTL0_FLEXSPI1FCLKDIV_DIV(divider - 1);
            while ((CLKCTL0->FLEXSPI1FCLKDIV) & CLKCTL0_FLEXSPI1FCLKDIV_REQFLAG_MASK)
            {
            }
            /* Enable FLEXSPI clock again */
            CLKCTL0->PSCCTL0_SET = CLKCTL0_PSCCTL0_SET_FLEXSPI1_CLK_MASK;

            BOARD_InitFlash(base);
        }
    }
    else
    {
        return;
    }
}

/* This function is used to change FlexSPI clock to a stable source before clock sources(Such as PLL and Main clock)
 * updating in case XIP(execute code on FLEXSPI memory.) */
void BOARD_FlexspiClockSafeConfig(void)
{
    /* Move FLEXSPI clock source from main clock to FRO192M / 2 to avoid instruction/data fetch issue in XIP when
     * updating PLL and main clock.
     */
    BOARD_SetFlexspiClock(FLEXSPI0, 3U, 2U);
}

void BOARD_SetDeepSleepPinConfig(void)
{
    /* Backup Pin configuration. */
    s_ispPin[0]     = IOPCTL->PIO[1][15];
    s_ispPin[1]     = IOPCTL->PIO[3][28];
    s_ispPin[2]     = IOPCTL->PIO[3][29];
    s_flexspiPin[0] = IOPCTL->PIO[1][18];
    s_flexspiPin[1] = IOPCTL->PIO[1][19];
    s_flexspiPin[2] = IOPCTL->PIO[1][20];
    s_flexspiPin[3] = IOPCTL->PIO[1][21];
    s_flexspiPin[4] = IOPCTL->PIO[1][22];
    s_flexspiPin[5] = IOPCTL->PIO[1][23];
    s_flexspiPin[6] = IOPCTL->PIO[1][24];
    s_flexspiPin[7] = IOPCTL->PIO[1][25];
    s_flexspiPin[8] = IOPCTL->PIO[1][26];
    s_flexspiPin[9] = IOPCTL->PIO[1][27];

    /* Disable ISP Pin pull-ups and input buffers to avoid current leakage */
    IOPCTL->PIO[1][15] = 0;
    IOPCTL->PIO[3][28] = 0;
    IOPCTL->PIO[3][29] = 0;

    /* Disable unnecessary input buffers */
    IOPCTL->PIO[1][18] &= ~IOPCTL_PIO_IBENA_MASK;
    IOPCTL->PIO[1][19] &= ~IOPCTL_PIO_IBENA_MASK;

    /* Enable pull-ups floating FlexSPI0 pins */
    IOPCTL->PIO[1][20] |= IOPCTL_PIO_PUPDENA_MASK | IOPCTL_PIO_PUPDSEL_MASK;
    IOPCTL->PIO[1][21] |= IOPCTL_PIO_PUPDENA_MASK | IOPCTL_PIO_PUPDSEL_MASK;
    IOPCTL->PIO[1][22] |= IOPCTL_PIO_PUPDENA_MASK | IOPCTL_PIO_PUPDSEL_MASK;
    IOPCTL->PIO[1][23] |= IOPCTL_PIO_PUPDENA_MASK | IOPCTL_PIO_PUPDSEL_MASK;
    IOPCTL->PIO[1][24] |= IOPCTL_PIO_PUPDENA_MASK | IOPCTL_PIO_PUPDSEL_MASK;
    IOPCTL->PIO[1][25] |= IOPCTL_PIO_PUPDENA_MASK | IOPCTL_PIO_PUPDSEL_MASK;
    IOPCTL->PIO[1][26] |= IOPCTL_PIO_PUPDENA_MASK | IOPCTL_PIO_PUPDSEL_MASK;
    IOPCTL->PIO[1][27] |= IOPCTL_PIO_PUPDENA_MASK | IOPCTL_PIO_PUPDSEL_MASK;
}

void BOARD_RestoreDeepSleepPinConfig(void)
{
    /* Restore the Pin configuration. */
    IOPCTL->PIO[1][15] = s_ispPin[0];
    IOPCTL->PIO[3][28] = s_ispPin[1];
    IOPCTL->PIO[3][29] = s_ispPin[2];

    IOPCTL->PIO[1][18] = s_flexspiPin[0];
    IOPCTL->PIO[1][19] = s_flexspiPin[1];
    IOPCTL->PIO[1][20] = s_flexspiPin[2];
    IOPCTL->PIO[1][21] = s_flexspiPin[3];
    IOPCTL->PIO[1][22] = s_flexspiPin[4];
    IOPCTL->PIO[1][23] = s_flexspiPin[5];
    IOPCTL->PIO[1][24] = s_flexspiPin[6];
    IOPCTL->PIO[1][25] = s_flexspiPin[7];
    IOPCTL->PIO[1][26] = s_flexspiPin[8];
    IOPCTL->PIO[1][27] = s_flexspiPin[9];
}

void BOARD_EnterDeepSleep(const uint32_t exclude_from_pd[4])
{
    BOARD_SetDeepSleepPinConfig();
    POWER_EnterDeepSleep(exclude_from_pd);
    BOARD_RestoreDeepSleepPinConfig();
}

void BOARD_EnterDeepPowerDown(const uint32_t exclude_from_pd[4])
{
    BOARD_SetDeepSleepPinConfig();
    POWER_EnterDeepPowerDown(exclude_from_pd);
    /* After deep power down wakeup, the code will restart and cannot reach here. */
    BOARD_RestoreDeepSleepPinConfig();
}

#if defined(SDK_I2C_BASED_COMPONENT_USED) && SDK_I2C_BASED_COMPONENT_USED
void BOARD_I2C_Init(I2C_Type *base, uint32_t clkSrc_Hz)
{
    i2c_master_config_t i2cConfig = {0};

    I2C_MasterGetDefaultConfig(&i2cConfig);
    I2C_MasterInit(base, &i2cConfig, clkSrc_Hz);
}

status_t BOARD_I2C_Send(I2C_Type *base,
                        uint8_t deviceAddress,
                        uint32_t subAddress,
                        uint8_t subaddressSize,
                        uint8_t *txBuff,
                        uint8_t txBuffSize)
{
    i2c_master_transfer_t masterXfer;

